EDT/УТ/src/Catalogs/ПричиныОтказаПереноса/ПричиныОтказаПереноса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПричиныОтказаПереноса</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Брак</name>
      <description>Брак</description>
    </items>
    <items>
      <name>КлиентаНетНаМесте</name>
      <description>Клиента нет на месте</description>
    </items>
    <items>
      <name>НеДозвонилисьДоКлиента</name>
      <description>Не дозвонились до клиента</description>
    </items>
    <items>
      <name>НеТотТовар</name>
      <description>Не тот товар</description>
    </items>
    <items>
      <name>НеУспелиПоВремени</name>
      <description>Не успели по времени</description>
    </items>
    <items>
      <name>ОтказКлиента</name>
      <description>Отказ клиента</description>
    </items>
    <items>
      <name>ПереносЗаказовВСвязиСПревышениемЛимита</name>
      <description>Перенос заказов в связи с превышением лимита</description>
    </items>
    <items>
      <name>ПоПисьмуМагазина</name>
      <description>По письму магазина</description>
    </items>
    <items>
      <name>ПоПросьбеКлиента</name>
      <description>По просьбе клиента</description>
    </items>
  </predefined>
  <attributes>
    <name>СторонаПретензии</name>
    <type>
      <types>EnumRef.СторонаПретензий</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораВМП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораЛогистом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребоватьВводНовогоАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребоватьСменуИнтервала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Забор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторСостояния</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораВАдминке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораПриГрупповойОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступностьПоПричинамНеВыполненияЗаказа</name>
    <attributes>
      <name>ПричинаНевыполнения</name>
      <type>
        <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Доступность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/ВзаимосвязьПричинВозвратаOZON/ВзаимосвязьПричинВозвратаOZON.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВзаимосвязьПричинВозвратаOZON</name>
  <resources>
    <name>ПричинаВозвратаOZON</name>
    <type>
      <types>CatalogRef.oz_ПричиныВозврата</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПричинаВозвратаУТЛ</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/ПричиныОтказаПереноса/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЧтениеПараметровРСВзаимосвязьПричинВозвратаOZON()
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(oz_ПричиныВозврата) Тогда
		Отказ = Истина;
		Сообщить("Не заполнена ПричиныВозвратаОзон!", СтатусСообщения.ОченьВажное);
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Объект.СторонаПретензии) Тогда
		Отказ = Истина;
		Сообщить("Не заполнена сторона претензии причины!", СтатусСообщения.ОченьВажное);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЧтениеПараметровРСВзаимосвязьПричинВозвратаOZON()

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВзаимосвязьПричинВозвратаOZON.ПричинаВозвратаOZON КАК ПричинаВозвратаOZON,
	                      |	ВзаимосвязьПричинВозвратаOZON.ПричинаВозвратаУТЛ КАК ПричинаВозвратаУТЛ
	                      |ИЗ
	                      |	РегистрСведений.ВзаимосвязьПричинВозвратаOZON КАК ВзаимосвязьПричинВозвратаOZON
	                      |ГДЕ
	                      |	ВзаимосвязьПричинВозвратаOZON.ПричинаВозвратаУТЛ = &ПричинаВозвратаУТЛ");
	Запрос.УстановитьПараметр("ПричинаВозвратаУТЛ", Объект.Ссылка);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда				
		oz_ПричиныВозврата = Рез.ПричинаВозвратаOZON;
		СтароеЗначениеПричиныOZON = oz_ПричиныВозврата;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ЗаписьПараметровРСВзаимосвязьПричинВозвратаOZON()

	ТекВр = ТекущаяДата();
	
	Набор = РегистрыСведений.ВзаимосвязьПричинВозвратаOZON.СоздатьНаборЗаписей();
	Набор.Отбор.ПричинаВозвратаУТЛ.Установить(Объект.Ссылка);
	Набор.Прочитать();
	
	НЗапись = Набор.Добавить();
	НЗапись.ПричинаВозвратаУТЛ = Объект.Ссылка;
	НЗапись.ПричинаВозвратаOZON = oz_ПричиныВозврата;
	НЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Набор.Записать();	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(oz_ПричиныВозврата) И СтароеЗначениеПричиныOZON <> oz_ПричиныВозврата Тогда
		ЗаписьПараметровРСВзаимосвязьПричинВозвратаOZON()
	КонецЕсли;	
КонецПроцедуры
